`timescale 1ns / 1ps

module instruction_mem(
	input  logic [31:0] instr_addr,
	output logic [31:0] instr_code
    );

	logic [31:0] instr_rom[0:127];
`ifdef TEST_SIMULATION
	initial begin
///////////////////////////////////////////////////////////////////////////////////////////////////////
// R-type
///////////////////////////////////////////////////////////////////////////////////////////////////////
		//instr_rom[0] = 32'h0031_02b3; // x5 = x2 + x3
		//instr_rom[1] = 32'h0041_82b3; // x5 = x4 + x3
		//instr_rom[1] = 32'h4045_0333; // 
		//instr_rom[2] = 32'h4045_02b3; // sub x5, x10, x4
		//instr_rom[2] = 32'h0030_93b3; // sll x7, x1, x3 => 8
		//instr_rom[3] = 32'h0051_2433; // slt x8, x2, x5 => 1
		//instr_rom[4] = 32'h0051_34b3; // sltu x9, x2, x5 => 1
		//instr_rom[5] = 32'h0032_c533; // xor x10, x5, x3 => 6
		//instr_rom[6] = 32'h0028_55b3; // srl x11, x16, x2 => 4
		//instr_rom[7] = 32'h4028_5633; // sra x12, x16, x2 =>4
		//instr_rom[8] = 32'h0032_e6b3; // or x13, x5, x3 =>7
		//instr_rom[9] = 32'h0033_f733; // and x14, x7, x3 => 0
		//	//---------------------------------------------------
    	//	// register_file 초기값 추가 필요
    	//	//
    	//	// x20 = -8
    	//	// x23 = 1
    	//	//
    	//	// register_file[20] = -8;
    	//	// register_file[23] = 1;
    	//	//----------------------------------------------------
		//instr_rom[0] = 32'h003a_27b3; // slt x15, x20, x3 => TRUE
		//instr_rom[1] = 32'h003a_3833; // sltu x16, x20, x3 => FALSE => 4294967288 < 3
		//instr_rom[2] = 32'h017a_58b3; // srl x17, x20, x23 => 7ffffffc
		//instr_rom[3] = 32'h417a_5933; // sra x18, x20, x23 => fffffffc = -4
///////////////////////////////////////////////////////////////////////////////////////////////////////
// S-type
///////////////////////////////////////////////////////////////////////////////////////////////////////
		//instr_rom[1] = 32'h00312223; // sw x3, 4(x2) //address = x2 + 4 = 2 + 4 = 6 //MEM[6] = x3 = 3
	    //instr_rom[2] = 32'h005111a3; // sh x5, 3(x2)
		//instr_rom[3] = 32'h003100a3; // sb x3, 1(x2) // address = x2 + 1 = 2 + 1 = 3 // byte 저장 테스트
	    //instr_rom[2] = 32'h00312123; // sw x2, 2(x3)
		//instr_rom[0] = 32'h00312223;// sw x3, 4(x2) // addr = 6
		//instr_rom[1] = 32'h00311123;// sh x3, 2(x2) // addr = 4
		//instr_rom[2] = 32'h003100a3;// sb x3, 1(x2)// addr = 3
		// 초기값 : data_ram[1] = 32'h12345678
		//instr_rom[0] = 32'h003102a3; // sb x3, 5(x2), data_ram[1] : 12345678 -> 03345678
		//instr_rom[1] = 32'h00411223; // sh x4, 4(x2), data_ram[1] : 03345678 -> 00045678
		//instr_rom[2] = 32'h00512223; // sw x5, 4(x2), data_ram[1] : 00045678 -> 00000005
		//instr_rom[0] = 32'h003102a3; // sb x3, 5(x2) -> data_ram[1]: 12345678 -> 12345603
		//instr_rom[1] = 32'h00411223; // sh x4, 4(x2) -> data_ram[1]: 12345603 -> 12340004
		//instr_rom[2] = 32'h00512223; // sw x5, 4(x2) -> data_ram[1]: 12340004 -> 00000005
///////////////////////////////////////////////////////////////////////////////////////////////////////
// IL-type
///////////////////////////////////////////////////////////////////////////////////////////////////////
		//instr_rom[3] = 32'h0021_2403; // lw x8, x2, 2 : rd, rs1, imm
		//instr_rom[3] = 32'h00110503; // lb x10, 1(x2)
		//instr_rom[4] = 32'h00211583; // lh x11, 2(x2)
		//instr_rom[5] = 32'h00412603; // lw x12, 4(x2)
		//instr_rom[6] = 32'h00114683; // lbu x13, 1(x2)
		//instr_rom[7] = 32'h00215703; // lhu x14, 2(x2)
		// data_ram[1] = 32'h80FF1234
		//instr_rom[0] = 32'h00510503; // lb  x10, 5(x2) => signed byte load(0x80), sign-extension, x10 = 0xFFFFFF80
		//instr_rom[1] = 32'h00514583; // lbu x11, 5(x2) => unsigned byte load(0x80), zero-extension, x11 = 0x00000080
		//instr_rom[2] = 32'h00411603; // lh  x12, 4(x2) => signed halfword load(0x80FF), sign-extension, x12 = 0xFFFF80FF
		//instr_rom[3] = 32'h00415683; // lhu x13, 4(x2) => unsigned halfword load(0x80FF), zero-extension, x13 = 0x000080FF
		//instr_rom[4] = 32'h00412703; // lw  x14, 4(x2) => word load(0x80FF1234), x14 = 0x80FF1234
///////////////////////////////////////////////////////////////////////////////////////////////////////
// I-type
///////////////////////////////////////////////////////////////////////////////////////////////////////
		//instr_rom[0] = 32'h003A2293; // slti x5, x20, 3 => signed 비교(-8 < 3) TRUE, x5 = 1
		//instr_rom[1] = 32'h003A3313; // sltiu x6, x20, 3 => unsigned 비교(0xFFFF_FFF8 < 3) FALSE, x6 = 0
		//instr_rom[2] = 32'h001A5393; // srli x7, x20, 1 => logical right shift, x7 = 0x7FFFFFFC
		//instr_rom[3] = 32'h401A5413; // srai x8, x20, 1 => sign bit 유지, x8 = 0xFFFFFFFC(-4)
		//instr_rom[5] = 32'h00A13313; // I : sltiu x6, x20, 3 => x6 = 0 false
		//instr_rom[6] = 32'h00F14393; // I : xori x7, x2, 15 => x7 = 13(0xD)
		//instr_rom[7] = 32'h00F16413; // I : ori x8, x2, 15 => x8 = 15(0xF)
		//instr_rom[8] = 32'h00F17493; // I : andi x9, x2, 15 => x9 = 2
		//instr_rom[9] = 32'h00211513; // I : slli x10, x2, 2 => x10 = 8
		//instr_rom[10] = 32'h00115593; // I : srli x11, x2, 1 => x11 = 1
		//instr_rom[11] = 32'h401a5613; // I : srai x12, x20, 1 => FFFFFFFC(-4)
		//instr_rom[4] = 32'h0013_8413;  // addi x8, x7, 4 : re, rs1, imm
		
///////////////////////////////////////////////////////////////////////////////////////////////////////
// B-type
///////////////////////////////////////////////////////////////////////////////////////////////////////
		//x20 = -8, x23 = 1 (register_file 초기값 사용)
		//instr_rom[0] = 32'h003a4463; // blt  x20, x3, 8  => signed(-8 < 3) true  -> taken
		//instr_rom[2] = 32'h003a7663; // bgeu x20, x3, 12 => unsigned(0xFFFFFFF8 >= 3) true -> taken
		//instr_rom[5] = 32'h003a1463; // bne  x20, x3, 8  => -8 != 3 true -> taken
		//instr_rom[7] = 32'h003a0463; // beq  x20, x3, 8  => -8 == 3 false -> not taken
///////////////////////////////////////////////////////////////////////////////////////////////////////
// UL-type
///////////////////////////////////////////////////////////////////////////////////////////////////////
		//instr_rom[0] = 32'h123452b7; // lui x5, 0x12345 => x5 = 0x12345000
///////////////////////////////////////////////////////////////////////////////////////////////////////
// UA-type
///////////////////////////////////////////////////////////////////////////////////////////////////////
		//instr_rom[1] = 32'h12345297; // auipc x5, 0x12345 => x5 = PC + 0x12345000

///////////////////////////////////////////////////////////////////////////////////////////////////////
// J-type(JAL)
///////////////////////////////////////////////////////////////////////////////////////////////////////
		//instr_rom[1] = 32'h0080036f; // jal x6, 8 => x6 = PC+4 저장, PC = PC+8 jump
		//instr_rom[2] = 32'h123452b7; // skipped (jump 때문에 실행 안 됨)
		//instr_rom[3] = 32'h45678337; // jump 도착 후 실행
///////////////////////////////////////////////////////////////////////////////////////////////////////
// JL-type(JALR)
///////////////////////////////////////////////////////////////////////////////////////////////////////
		// x3 = 3 (초기값)
		//instr_rom[1] = 32'h00818367; // jalr x6, 8(x3) => x6 = PC+4 저장, PC = x3+8 = 11
		//instr_rom[2] = 32'h123452b7; // skipped
		//instr_rom[3] = 32'h45678337; // skipped

	end
`endif
	initial begin
		$readmemh("instruction_code.mem",instr_rom); // 불러올때 경로가 같아야함. 만일 디렉토리에서 불러오면 앞에 경로 작성해줘야함
		//$readmemh("instruction_mem_sort.mem",instr_rom); 
	end

	assign instr_code = instr_rom[instr_addr[31:2]]; // byte aline을 하는데, 그래서 주소가 4씩증가하는데 뒷비트 2개 짤라버리면 1씩오르는게 결국 4씩 오르는걸로됨

endmodule
